# Filtering

Filter on:
1. Invalid messages
2. outside timeframe
3. non english tweets
4. duplicated tweets/spam users
5. retweets


Postgres -> Pandas:
> dataframe = psql.read_sql("SELECT * FROM ", connection)

In [5]:
import os
from dotenv import find_dotenv, load_dotenv
import psycopg2 as pg
import pandas.io.sql as psql

In [2]:
# Load variables from .env, connect to DB
load_dotenv(find_dotenv())
database_url = os.environ.get('DATABASE_URL')

conn = pg.connect(database_url)
curr = conn.cursor()

Count how many tweets we have total.

In [3]:
curr.execute('SELECT COUNT(*) FROM raw_tweets;')
num_total_tweets = curr.fetchone()[0]
print ('Total tweets:\t{}'.format(num_total_tweets))

Total tweets:	461556424

### Valid Messages

Get count of both NULL and NOT NULL in one query:
> select count(*) - count(a), count(a) from us;

In [4]:
curr.execute('SELECT count("message"), COUNT(*) - COUNT("message") from raw_tweets;')
num_valid_message, num_null_message = curr.fetchone()

print ('Valid:\t{}\nInvalid\t{}'.format(num_valid_message, num_null_message))

Valid:	460215960
Invalid	1340464

### Timestamps and Dates

- Date of: Jan 27th, 2017
- Min Date (-4 weeks): Friday, December 30, 2016
- Max Date (+4 weeks): Friday, February 24, 2017


> WHERE datefield >= '2010-01-01 00:00:00'

In [6]:
date_range_query = "SELECT MIN(date), MAX(date) FROM raw_tweets;"
curr.execute(date_range_query)
date_min, date_max = curr.fetchone()

print ('Min Date:\t{}\nMax Date:\t{}'.format(date_min, date_max))

date_filter_query = "SELECT COUNT(*) FROM raw_tweets WHERE date >= '2016-12-30 04:00:00' AND date < '2017-02-24 04:00:00';"
curr.execute(date_filter_query)
num_valid_date = curr.fetchone()[0]
print ('Valid date range tweets:\t{}'.format(num_valid_date))

Min Date:	2016-12-22 17:36:32
Max Date:	2018-04-03 15:18:40
Valid date range tweets:	72397072

### Language

> SELECT COUNT(CustomerID), Country
>
> FROM Customers
>
> GROUP BY Country
> 
> ORDER BY COUNT(CustomerID) DESC

In [8]:
# count languages
# dataframe = psql.read_sql("SELECT * FROM ", connection)

lang_sql = """SELECT language, COUNT(language) FROM raw_tweets GROUP BY language ORDER BY COUNT(language) DESC;"""

lang_df = psql.read_sql(lang_sql, conn)
lang_df.head(30)

   language      count
0        en  233624341
1        ar  176246762
2        fr   13745440
3        es   10557995
4        id    8175217
5     en-gb    4442070
6        de    3053145
7        tr    2504156
8        nl    2417177
9        ru    1110983
10       it     999338
11       pt     944634
12    en-GB     882577
13       sv     531650
14       ja     495201
15       ca     328373
16       pl     293685
17       he     129120
18       da     123081
19       th      94836
20       fi      87769
21       ko      86117
22       hi      73327
23       el      68202
24       no      63796
25       fa      61998
26    zh-cn      60497
27       cs      58109
28       hu      34403
29      msa      30309

In [9]:
lang_df.iloc[:]

    language      count
0         en  233624341
1         ar  176246762
2         fr   13745440
3         es   10557995
4         id    8175217
5      en-gb    4442070
6         de    3053145
7         tr    2504156
8         nl    2417177
9         ru    1110983
10        it     999338
11        pt     944634
12     en-GB     882577
13        sv     531650
14        ja     495201
15        ca     328373
16        pl     293685
17        he     129120
18        da     123081
19        th      94836
20        fi      87769
21        ko      86117
22        hi      73327
23        el      68202
24        no      63796
25        fa      61998
26     zh-cn      60497
27        cs      58109
28        hu      34403
29       msa      30309
..       ...        ...
82        ae         13
83        ku          9
84        ld          8
85     pt-BR          7
86        is          6
87        zz          5
88        mn          4
89     de-AT          4
90        mk          4
91        ml          4
92        ka          4
93        uz          4
94        co          3
95        ht          3
96       gsw          2
97       haw          2
98        bs          2
99        am          2
100       to          2
101       jv          2
102    nl-BE          2
103    en-ss          2
104       my          1
105       ig          1
106       us          1
107  az-Cyrl          1
108    de-CH          1
109      nap          1
110  pa-Arab          1
111     None          0

[112 rows x 2 columns]

In [10]:
filter_language = "SELECT COUNT(*) FROM raw_tweets WHERE LEFT(language, 2) LIKE 'en';"
curr.execute(filter_language)
num_english_tweets = curr.fetchone()[0]

print ('English tweets:\t{}'.format(num_english_tweets))
print ('Non english tweets:\t{}'.format(num_total_tweets-num_english_tweets))

English tweets:	238984132
Non english tweets:	222572292

### Duplicated Tweets and Spammy users

> select a,b from dup group by a,b having count(*) > 1; 
> 
> select regno from mytable group by regno having count(stockno) > 1;
>
> SELECT [EmailAddress], [CustomerName] FROM [Customers] WHERE [EmailAddress] IN
  (SELECT [EmailAddress] FROM [Customers] GROUP BY [EmailAddress] HAVING COUNT(*) > 1)

In [7]:
dupe_query = """
SELECT 
    "username", "tweetID", "message" 
FROM 
    raw_tweets 
WHERE 
    "tweetID" IN (SELECT "tweetID" FROM raw_tweets GROUP BY "tweetID" HAVING COUNT(*) > 1);
"""


dupe_df = psql.read_sql(dupe_query, conn)
dupe_df.head(20)

,username,tweetID,message
0,jacko1luv,978013654363918336,RT : Turkish leaders; including Muslim Preside...
1,Hieiandshino,978019727653199872,RT : Just like they’ve smeared protesters duri...
2,Hieiandshino,978019727653199872,RT : Just like they’ve smeared protesters duri...
3,DLPBurke,978029941597130753,We have no laws here now. We gave up law and ...
4,DLPBurke,978029941597130753,We have no laws here now. We gave up law and ...
5,GettBoba,978031781806043136,Oxford my star; Muslim middle eastern rapists
6,GettBoba,978031781806043136,Oxford my star; Muslim middle eastern rapists
7,matantemorin,978071791292813312,RT : Notre qualité de vie et notre capacité de...
8,matantemorin,978071791292813312,RT : Notre qualité de vie et notre capacité de...
9,3thman_kh,978074226472181761,اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحز...
10,3thman_kh,978074226472181761,اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحز...
11,KosmetikDinda,978104761588187136,RT : Melihat dan menyikapi kondisi kekinian; m...
12,KosmetikDinda,978104761588187136,RT : Melihat dan menyikapi kondisi kekinian; m...
13,RaviGup01391931,978113820047675393,RT : इस वक़्त क्यों ज़रूरी है यह जानने के लिए...
14,RaviGup01391931,978113820047675393,RT : इस वक़्त क्यों ज़रूरी है यह जानने के लिए...
15,ronavioleta,978124151679414272,RT : Waspada akun ngaku >> << isinya sama pers...
16,ronavioleta,978124151679414272,RT : Waspada akun ngaku >> << isinya sama pers...
17,sturm_tracey,978142769104367617,RT : UN Secretary General “demands” that Trump...
18,sturm_tracey,978142769104367617,RT : UN Secretary General “demands” that Trump...
19,saurabhfeb2010,978149558352949248,RT : Hi! My name is Rahul Pappu Gandhi.I wish ...

### Retweets

In [11]:
# First see how many retweets we have
curr.execute('SELECT count("retweet"), COUNT(*) - COUNT("retweet") from raw_tweets;')
num_valid_rt, num_null_rt = curr.fetchone()

print ('Retweets:\t{}\nOriginal Tweets\t{}'.format(num_valid_rt, num_null_rt))

Retweets:	164575369
Original Tweets	296981055

In [9]:
# Take a look at some retweets
rt_query = 'SELECT retweet FROM raw_tweets WHERE retweet IS NOT NULL LIMIT 100;'
rt_df = psql.read_sql(rt_query, conn)

rt_df.head(20)

   retweet
0       RT
1       RT
2       RT
3       RT
4       RT
5       RT
6       RT
7       RT
8       RT
9       RT
10      RT
11      RT
12      RT
13      RT
14      RT
15      RT
16      RT
17      RT
18      RT
19      RT

In [10]:
filter_retweets = 'SELECT COUNT(*) FROM raw_tweets WHERE retweet'

### Filter all

```
SELECT
    # Only select unduplicated tweets from database
    DISTINCT ON ("tweetID")
    *
FROM 
    raw_tweets
WHERE
    # Tweets need a message for consideration
    (message IS NOT NULL) AND
    # Don't grab retweets
    (retweet IS NULL) AND
    # Only grab english flagged tweets
    (LEFT(language, 2) LIKE 'en') AND
    # Only grab location verified tweets
    (latitude IS NOT NULL) AND
    (longitude IS NOT NULL);
```

**---**

```
INSERT INTO filter_tweets
SELECT DISTINCT ON ("tweetID") *
FROM   raw_tweets
WHERE  ( message IS NOT NULL )
       AND ( retweet IS NULL )
       AND ( Left(LANGUAGE, 2) LIKE 'en' )
       AND ( latitude IS NOT NULL )
       AND ( DATE >= '2016-12-30 04:00:00'
             AND DATE < '2017-02-24 04:00:00' )
       AND ( longitude IS NOT NULL ); 
```

In [18]:
filter_sql = """
SELECT DISTINCT ON ("tweetID") COUNT(*)
FROM   raw_tweets
WHERE  ( message IS NOT NULL )
       AND ( retweet IS NULL )
       AND ( Left(LANGUAGE, 2) LIKE 'en' )
       AND ( latitude IS NOT NULL )
       AND ( DATE >= '2016-12-30 04:00:00'
             AND DATE < '2017-02-24 04:00:00' )
       AND ( longitude IS NOT NULL );
"""


curr.execute(filter_sql)
num_after_filters = curr.fetchone()

print ('Total\t\t{}\nFilters applied:\t{}'.format(num_total_tweets, num_after_filters))

ProgrammingError: column "raw_tweets.tweetID" must appear in the GROUP BY clause or be used in an aggregate function
LINE 2: SELECT DISTINCT ON ("tweetID") COUNT(*)
                            ^

In [20]:
print ('Total:\t{}\nFiltered:\t{}'.format(num_total_tweets, len(filter_df)))
filter_df.head()

Total:	617512
Filtered:	119737

,id,tweetID,date,message,username,userID,language,longitude,latitude,retweet
0,346075,812080849239810048,2016-12-22 17:42:16,PrisonPlanetTV: RT PrisonPlanet: Muslim YouTub...,RJazz117,19497260,en,114.627525,-3.351165,None
1,346775,812081118619041792,2016-12-22 17:43:21,اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحز...,ghuwainm,2252611996,en,114.627525,-3.351165,None
2,346975,812081201355878406,2016-12-22 17:43:40,what religion were the flames ? Muslim I bet eh,__ZAINRAJA,48112908,en,114.627525,-3.351165,None
3,347503,812081414128615424,2016-12-22 17:44:31,Barack takes the utmost care to avoid offendi...,Asher_P_Fly,714798361,en,107.607830,-6.914070,None
4,347603,812081456121987072,2016-12-22 17:44:41,i was so proud of how far the UK had come in t...,TellDramaUK,3068652335,en,107.607830,-6.914070,None

### Select and insert into new table

In [23]:
sel_insert_sql = """INSERT INTO filter_tweets """ + filter_sql

In [24]:
sel_insert_sql

'INSERT INTO filter_tweets \nSELECT\n    DISTINCT ON ("tweetID")\n    *\nFROM \n    raw_tweets\nWHERE\n    (message IS NOT NULL) AND\n    (LEFT(language, 2) LIKE \'en\') AND\n    (latitude IS NOT NULL) AND\n    (longitude IS NOT NULL) AND\n    (retweet IS NULL);\n'

In [25]:
conn.close()